app/views/projects/_bug_container.html.slim

        div class="panel-body #{css} container-fluid sortable" state="#{state}"
            - @project.bugs.where(:state => state).each do |bug|
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."project_id" = ? AND "bugs"."state" = ?  [["project_id", 5], ["state", "Novo"]]