app/views/projects/_project.html.slim

SELECT COUNT(*) FROM "bugs" WHERE "bugs"."project_id" = ?  [["project_id", 5]]
---
        div class="col-xs-4 text-right"
            <span class="badge">#{project.bugs.count} Bugs</span>