app/views/bugs/_form.html.slim

    div class="form-group has-feedback"
        = f.select :user_id, User.all.collect {|u| [ u.name, u.id ] }, { include_blank: "Selecione o Responsável" }, { class: "form-control" }
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]