app/controllers/bugs_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def new
        @bug = Bug.new
        @bug.project = Project.find(params[:project_id])

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @bug = Bug.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "bugs" ("description", "steps", "project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["description", "Bug 1 "], ["steps", "Teste"], ["project_id", 5], ["user_id", 1], ["created_at", "2017-06-17 21:20:17.846533"], ["updated_at", "2017-06-17 21:20:17.846533"]]
---
    def create
        @bug = Bug.new(bug_params)

        @bug.project = Project.find(params[:project_id])

        unless params.require(:bug)[:user_id].to_s.empty?
            @bug.user = User.find(params.require(:bug)[:user_id])
        end

        if @bug.save

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "bugs" SET "user_id" = ?, "state" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["user_id", 4], ["state", "Em Progresso"], ["updated_at", "2017-06-20 03:12:47.601733"], ["id", 16]]
---
    def update
        @bug = Bug.find(params[:id])


        @bug.project = Project.find(params[:project_id])

        user_removed = params.require(:bug)[:user_id].to_s.empty? && @bug.user != nil

        unless params.require(:bug)[:user_id].to_s.empty?
            @bug.user = User.find(params.require(:bug)[:user_id])
        else
            @bug.user = nil
        end

        state_changed = @bug.state != params.require(:bug)[:state]
        user_changed = !params.require(:bug)[:user_id].to_s.empty? && @bug.user.id != params.require(:bug)[:user_id]

        if @bug.update(bug_params)

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "bugs" SET "state" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["state", "Em Progresso"], ["updated_at", "2017-06-19 02:46:10.186530"], ["id", 5]]
---
    def change_state
        @bug = Bug.find(params[:id])

        if @bug.update(:state => params[:state])

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bugs" WHERE "bugs"."id" = ?  [["id", 1]]
---
    def destroy
        @bug = Bug.find(params[:id])
        @bug.destroy

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @bug = Bug.find(params[:id])