app/controllers/home_controller.rb

  def index
      @projects = Project.all
      @bugs = Bug.where(:user => current_user)
---
SELECT "projects".* FROM "projects"
SELECT "bugs".* FROM "bugs" WHERE "bugs"."user_id" = 1