app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Teste"], ["created_at", "2017-06-17 05:08:09.984882"], ["updated_at", "2017-06-17 05:08:09.984882"]]
---
    def create
        @project = Project.new(project_params)

        if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Teste 3 - Alterado"], ["updated_at", "2017-06-17 05:42:06.273604"], ["id", 3]]
---
    def update
        @project = Project.find(params[:id])

        if @project.update(project_params)